<?php 

namespace Model;

class StringManager {
	static function normalize($string){
	     $utf8 = array(
                  '/[áàâãªäåæ]/u' => 'a',
                  '/[ÁÀÂÃÄÅÆ]/u' => 'A',
                  '/[éèêë]/u' => 'e',
                  '/[ÉÈÊË]/u' => 'E',
                  '/[ÍÌÎÏÍ]/u' => 'I',
                  '/[íìîï]/u' => 'i',
                  '/[óòôõºöðø]/u' => 'o',
                  '/[ÓÒÔÕÖØ]/u' => 'O',
                  '/[úùûü]/u' => 'u',
                  '/[ÚÙÛÜ]/u' => 'U',
                  '/[ýýÿ]/u' => 'y',
                  '/Š/u' => 'S',
                  '/š/u' => 's',
                  '/ç/' => 'c',
                  '/Ç/' => 'C',
                  '/Ð/' => 'Dj',
                  '/ñ/' => 'n',
                  '/Ñ/' => 'N',
                  '/Ý/' => 'Y',
                  '/Ž/' => 'Z',
                  '/ž/' => 'z',
                  '/þ/' => 'b',
                  '/Þ/' => 'B',
                  '/ƒ/' => 'f',
                  '/ß/' => 'ss',
                  '/Œ/' => 'Oe',
                  '/œ/' => 'oe',
                  '/–/' => '-',
                  '/[‘’‚‹›]/u' => ' ',
                  '/[“”«»„]/u' => ' ',
                  '/ /' => ' '
            );
		$str = preg_replace(array_keys($utf8), array_values($utf8), $string);
		$str = strtolower(str_replace(' ', '', $str));
		return $str;
	}

      static function noAccents($string) {
            $utf8 = array(
                  '/[áàâãªäåæ]/u' => 'a',
                  '/[ÁÀÂÃÄÅÆ]/u' => 'A',
                  '/[éèêë]/u' => 'e',
                  '/[ÉÈÊË]/u' => 'E',
                  '/[ÍÌÎÏÍ]/u' => 'I',
                  '/[íìîï]/u' => 'i',
                  '/[óòôõºöðø]/u' => 'o',
                  '/[ÓÒÔÕÖØ]/u' => 'O',
                  '/[úùûü]/u' => 'u',
                  '/[ÚÙÛÜ]/u' => 'U',
                  '/[ýýÿ]/u' => 'y',
                  '/Š/u' => 'S',
                  '/š/u' => 's',
                  '/ç/' => 'c',
                  '/Ç/' => 'C',
                  '/Ð/' => 'Dj',
                  '/ñ/' => 'n',
                  '/Ñ/' => 'N',
                  '/Ý/' => 'Y',
                  '/Ž/' => 'Z',
                  '/ž/' => 'z',
                  '/þ/' => 'b',
                  '/Þ/' => 'B',
                  '/ƒ/' => 'f',
                  '/ß/' => 'ss',
                  '/Œ/' => 'Oe',
                  '/œ/' => 'oe',
                  '/–/' => '-',
                  '/[‘’‚‹›]/u' => ' ',
                  '/[“”«»„]/u' => ' ',
                  '/ /' => ' '
            );
            $str = preg_replace(array_keys($utf8), array_values($utf8), $string);
            return $str;
      }


}